Tekla Open API Reference for Tekla Structures 2025
PourBreakAttributes Constructor
Overload List
Name | Description
PourBreak.PourBreakAttributes()
 Creates a new default pour break attributes instance that loads standard attributes.
PourBreak.PourBreakAttributes(String)
 Creates a new pour break attributes instance that loads the specified attributes.
Top
See Also
Reference
PourBreak.PourBreakAttributes Class
Tekla.Structures.Drawing Namespace